package question_060;
//Определите, какой результат получится при выполнении приведенного кода, если программа запустится с помощью строки java Class1 Hello world !!!
//Helloworldworld
//
public class Class1
{ 
   public static void main(String [] args) { 
      System.out.print(args[0] + args[1]); 
      System.out.println(args[1]); 
    } 
} 