package question_038;
//Какой будет результат компиляции и выполнения данного кода?
//Ошибка компиляции
//Выражение в правой части имеет тип double и не может быть неявно приведено к типу переменной в левой части (float).
public class Test {
    public static void main(String[] args) { 
        /*float f = 1.0 + 1.0f;
        f = f + 1; 
        System.out.println( f/0 ); */
    } 
}

//  Если переопределить в классе метод finalize(), то для объекта этого класса этот метод будет вызван:
//  Перед тем, как система сборки мусора уничтожит объект
//
